Repository: serb244/fake_store
Catalog: lib/l10n/intl_*.arb
Languages: uk

# error_data_parsing_failed
source: Data parsing failed.
uk: Не вдалося обробити дані.

# error_try_again
source: Please try again later.
uk: Спробуйте ще раз.

# error_unknown
source: An unexpected error occurred.
uk: Сталася непередбачена помилка.

# error_api_unknown
source: Під час запиту сталася непередбачена помилка.
uk: An unexpected error occurred while making the request.

# error_bad_request_400
source: Something went wrong with your request.
uk: Щось пішло не так з вашим запитом.

# error_unauthorized_password_401
source: You need to be authorized to access this resource. Please log in or sign up.
uk: Вам потрібна авторизація, щоб отримати доступ до цього ресурсу. Будь ласка, увійдіть або зареєструйтесь.

# error_forbidden_403
source: You don't have access to this resource.
uk: У вас немає доступу до цього ресурсу.

# error_not_found_404
source: We couldn't find what you're looking for.
uk: Не вдалося знайти те, що ви шукаєте.

# error_internal_server_500
source: Oops! We're having some technical difficulties.
uk: Вибачте, виникли технічні неполадки.

# error_bad_gateway_502
source: There's a problem with the server.
uk: Виникли проблеми з сервером.

# error_data_loading_failed
source: Data loading failed. Check your internet connection.
uk: Не вдалося завантажити дані. Перевірте підключення до Інтернету.

# error_connection_timeout
source: Connection to the server timed out. Please check your internet connection or try again later.
uk: Не вдалося підключитися до сервера. Перевірте підключення до Інтернету або спробуйте пізніше.

# error_send_timeout
source: There was an issue sending data. Please check your internet connection or try again later.
uk: Виникли проблеми з відправленням даних. Перевірте підключення до Інтернету або спробуйте пізніше.

# error_receive_timeout
source: There was an issue receiving data. Please check your internet connection or try again later.
uk: Виникли проблеми з отриманням даних. Перевірте підключення до Інтернету або спробуйте пізніше.

# error_bad_certificate
source: The website's security certificate might be invalid. Contact the website owner for help.
uk: Сертифікат безпеки веб-сайту може бути недійсним. Зверніться до власника веб-сайту за допомогою.

# error_bad_response
source: The website didn't send us a valid response.
uk: Веб-сайт не надіслав нам дійсну відповідь.

# error_api_cancel
source: The request was cancelled.
uk: Запит було скасовано.

# error_connection_error
source: Couldn't connect to the server. Check your internet connection.
uk: Не вдалося підключитися до сервера. Перевірте підключення до Інтернету.

# error_network_connection_failed
source: Check your internet connection.
uk: Перевірте підключення до Інтернету.

# error_invalid_email_format
source: Please enter a valid email address.
uk: Введіть дійсну адресу електронної пошти.

# error_validation_password_mismatch
source: The passwords you entered don't match.
uk: Паролі, які ви ввели, не збігаються.

# error_invalid_phone_number_format
source: Please enter a valid phone number.
uk: Введіть дійсний номер телефону.

# error_invalid_username_format
source: Please enter a valid username.
uk: Введіть дійсне ім'я користувача.

# error_user_not_found
source: The user was not found.
uk: Користувач не знайдений.

# error_email_already_in_use
source: This email address is already in use.
uk: Ця адреса електронної пошти вже використовується.

# error_username_already_in_use
source: This username is already in use.
uk: Це ім'я користувача вже використовується.

# error_invalid_verification_code
source: The verification code is invalid.
uk: Недійсний код підтвердження.

# error_verification_code_expired
source: The verification code has expired.
uk: Код підтвердження прострочений.

# error_account_not_activated
source: Your account has not been activated yet. Please check your email for the activation link.
uk: Ваш аккаунт не активовано. Перевірте свою електронну пошту на наявність посилання для активації.

# error_account_blocked
source: Your account has been blocked. Please contact support for help.
uk: Ваш аккаунт заблоковано. Зверніться до служби підтримки за допомогою.

# error_too_many_login_attempts
source: Too many login attempts.
uk: Занадто багато спроб входу. Спробуйте ще раз пізніше.

# error_password_reset_failed
source: Password reset failed.
uk: Скидання пароля не вдалося.

# error_invalid_token
source: The token is invalid.
uk: Недійсний токен.

# error_token_expired
source: The token has expired.
uk: Термін дії токена закінчився.

# error_session_expired
source: Your session has expired. Please log in again.
uk: Ваш сеанс закінчився. Будь ласка, увійдіть ще раз.
